// 즉시 실행 함수로 jQuery를 사용하도록 설정합니다.
$(function(){

    // ".gnb"라는 클래스를 가진 요소에 hover 이벤트를 설정합니다.
    // hover 이벤트는 마우스가 요소 위에 올라갔을 때와 벗어났을 때의 동작을 정의합니다.
    $(".gnb").hover(

        // 첫 번째 함수는 마우스가 요소 위로 올라갔을 때 실행됩니다.
        function(){
            
            // ".gnb ul" 즉, .gnb 클래스를 가진 요소의 자식인 ul 태그를 찾아
            // stop() 함수로 현재 진행 중인 모든 애니메이션을 정지시킨 후,
            // slideDown() 함수를 사용하여 서브 메뉴(ul)를 아래로 펼칩니다.
            // 이 효과는 메뉴가 점차적으로 보이게 하는 애니메이션을 만듭니다.
            $(".gnb ul").stop().slideDown()

        },

        // 두 번째 함수는 마우스가 요소에서 벗어났을 때 실행됩니다.
        function(){

            // 마찬가지로 ".gnb ul"을 대상으로 stop() 함수로 애니메이션을 정지시킨 후,
            // slideUp() 함수를 사용하여 서브 메뉴를 위로 접습니다.
            // 이 효과는 메뉴가 점차적으로 숨겨지는 애니메이션을 만듭니다.
            $(".gnb ul").stop().slideUp()

        }

    )

})
